{
  "httpMethod": "POST",
  "body": {
    "ResumeId": "1",
    "name": "Meghana Sai Vattikuti",
    "label": "Cloud Developer and Software Engineer",
    "email": "vattikuti.m@northeastern.edu",
    "url": "www.meghanasaivattikuti.com",
    "summary": "My coding adventure started with a humble calculator program nine years ago. Since then, I've delved into the complexities of Cloud and Software Development, embracing every challenge along the way! My experiences at Deloitte and Siemens were game-changers, reshaping how I approach problems and master them from scratch. Whether it's enhancing e-commerce systems or optimizing industrial applications, I've learned to immerse myself fully and always come out ready (AND ALIVE!) for the next adventure. I thrive on challenges that push the envelope and am perpetually on the lookout for the next big thing. My passion lies in leveraging technology to make life better and businesses smarter. I'm all about connecting, learning, and growing together. If you're navigating the thrilling world of tech and innovation, let's sync up! Whether it's a project collaboration or just a tech talk over coffee, feel free to reach out.",
    "location": {
      "address": "40 Forest Street",
      "postalCode": "MA 02119",
      "city": "Boston",
      "countryCode": "US",
      "region": "Massachusetts"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "meghanasai",
        "url": "https://www.linkedin.com/in/meghanasai/"
      }
    ],
    "work": [
      {
        "name": "Siemens",
        "position": "Software Developer",
        "url": "https://www.siemens.com/us/en.html",
        "startDate": "2023-05-11",
        "endDate": "2023-12-04",
        "summary": "Evaluated scalability of the infrastructure used by the service and improved customer overhead by 10% on a site load  Engineered an asset tree that detects new devices connecting to the network improving resource efficiency by 25% ,Designed and built a topology viewer for assets built on Zeek data providing real-time monitoring of connections and source ports highlighting network vulnerabilities, leading to a 30% increase in network issue debugging efficiency  Programmed a dark web threat intelligence telegram bot that detects dark web URLs, downloads their data for Autopsy analysis, tracks job status progress, updates users and tests file on demand"
      },
      {
        "name": "Deloitte",
        "position": "Business Technology Analyst",
        "url": "https://www2.deloitte.com/ui/en.html",
        "startDate": "2020-09-17",
        "endDate": "2022-06-09",
        "summary": "Streamlined B2B/B2C operations by 15% through microservice optimization and collaborative e-commerce solutions for products , Managed AWS services like EC2, S3, ECS, RDS, CloudWatch to achieve fault-tolerant, high availability scalable applications ,Investigated and troubleshooted system/performance issues to reduce downtime by 80% by facilitating root cause analysis, Led process optimization efforts with UiPath, yielding 2000 hours of reclaimed resource time , Spearheaded 15% application performance improvement through communication with cross-functional teams, collaborative codebase debugging and problem solving, logging, and order/customer management optimization using New Relic and Kibana"
      }
    ],
    "volunteer": [
      {
        "organization": "Code Your Dreams",
        "position": "Tech Community Lead",
        "url": "https://www.codeyourdreams.org/",
        "startDate": "2024-01-01",
        "endDate": "",
        "summary": "Create resources"
      },
      {
        "organization": "Northeastern University",
        "position": "MSIS Bridge Mentor",
        "url": "https://www.northeastern.edu/",
        "startDate": "2023-08-01",
        "endDate": "",
        "summary": "Mentor"
      }
    ],
    
    "education": [
      {
        "institution": "Northeastern University",
        "location": "Boston, MA",
        "degree": "Master of Science in Information Systems",
        "endDate": "2024-12-01"
      },
      {
        "institution": "Motilal Nehru National Institute of Technology",
        "location": "Allahabad, India",
        "degree": "Bachelor of Technology in Information Technology",
        "startDate": "2016-07-01",
        "endDate": "2020-07-01"
      }
      ],
    
    
    "certificates": [
      {
        "name": "AWS Certified Cloud Practitioner",
        "date": "2024-01-21",
        "issuer": "Amazon",
        "url": "https://www.credly.com/badges/635a838e-19bb-4aca-927a-a17024428032/public_url"
      }
    ],
    
   
    
    "projects": [
      {
        "name": "Analysis of GDP per Capita Income vs Mental Health",
        "startDate": "2024-02-01",
        "endDate": "2024-04-01",
        "description": "Utilized machine learning techniques, specifically linear regression to analyze correlation between GDP per capita and mental health outcomes, successfully modeling and predicting mental health status based on economic indicators across multiple datasets using libraries like scikit-learn. Managed data collection and preprocessing ensuring data integrity and applicability for model accuracy.",
        "highlights": [],
        "url": ""
      },
      {
        "name": "Cloud-Native Web Application (Node.js, PostgreSQL, AWS)",
        "startDate": "2023-01-01",
        "endDate": "2023-04-01",
        "description": "Built a cloud-native web app REST APIs using node.js, PostgreSQL, RESTful APIs, AWS S3, and DNS mapping for enhanced UX. Created custom AMIs with Packer and managed infrastructure-as-code with Terraform (VPCs, subnets, routes, EC2/RDS instances, S3 buckets, ELBs, security groups) by implementing version control on Git having low latency and high reliability. Implemented robust CI/CD pipelines on GitHub for seamless integration and rapid code deployment.",
        "highlights": [],
        "url": ""
      },
      {
        "name": "A Drop for Life, Northeastern University",
        "startDate": "2022-10-01",
        "endDate": "2022-12-01",
        "description": "Built a full-stack app with PayPal API for smooth payments, linking blood donors, recipients, banks, and hospitals. Leveraged Bootstrap, React, MongoDB, and Node.js for efficient frontend and backend web development.",
        "highlights": [],
        "url": ""
      }
    ],
    
    "leadershipAchievementsCertifications": [
      {
        "title": "Tech Community Lead for ‘Code Your Dreams’",
        "description": "Empowering underprivileged youth passionate about computer science"
      },
      {
        "title": "Grant recipient for AWS Reinvent",
        "description": "A leading cloud conference for workshops, discussions with experts, & valuable networking"
      },
      {
        "title": "One-on-one Mentorship",
        "description": "Empowered individuals through one-on-one mentorship, helping them navigate career paths and unlock their potential"
      },
      {
        "title": "Spot Awards",
        "description": "Received spot awards for reducing priority incidents by 40% for identification and troubleshooting infra issues and for RPA automation"
      },
      {
        "title": "Monetary Award",
        "description": "Received a monetary award for interaction with clients and handling high priority incidents during peak business, increasing sales by 10%"
      }
    ]
    
  }
    
}